{
  "format": "graph-model",
  "generatedBy": "2.13.0",
  "convertedBy": "TensorFlow.js Converter v4.10.0",
  "signature": { "outputs": { "Identity:0": { "name": "Identity:0" } } },
  "modelTopology": {
    "node": [
      {
        "name": "ConstantFolding/PartitionedCall/model_2/tf.math.divide/truediv_recip",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "1" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3287",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3279",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3281",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_19/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3289",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3273",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3275",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_16/StridedSlice/strides",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.reshape_3/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.compat.v1.transpose_4/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.compat.v1.transpose_5/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3277",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.compat.v1.transpose_8/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.reshape_4/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3283",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3285",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_18/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_17/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.math.multiply_185/Mul/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3211",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3223",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3235",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3247",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3259",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3269",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3209",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3221",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3233",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3245",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3257",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "26" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3271",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "26" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_10/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.compat.v1.transpose/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.reshape/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3207",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3219",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3231",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3243",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3255",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3265",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3205",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3217",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3229",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3241",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3253",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "26" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3267",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "26" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_13/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.compat.v1.transpose_1/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.reshape_1/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3203",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "256" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3215",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3227",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3239",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3251",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3261",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3193",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3195",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_14/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3163",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3165",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_12/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3133",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3135",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_10/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/lambda_1//model.13/Resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_7/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3117",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3119",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3121",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3123",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_11/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3125",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3127",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3129",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3131",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_8/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3137",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3139",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3141",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3143",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3145",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3109",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3111",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_8/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/lambda//model.10/Resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_5/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3093",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3095",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3097",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3099",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_9/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3101",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3103",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3105",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3107",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_6/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3113",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3115",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_9/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3147",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3149",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3151",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3153",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_13/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3155",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3157",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3159",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3161",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.concat_11/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3167",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3169",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3171",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "3173",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3175",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "3077",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3079",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_6/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3047",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3049",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_4/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3009",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "3011",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_2/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "2971",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "2973",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "2943",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "2945",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2947",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2949",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "2951",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2953",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2955",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2957",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2959",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "2961",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_2/tf.strided_slice_1/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "2963",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2965",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2967",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "2969",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
